{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "WhitespaceSplit"
      },
      {
        "type": "Split",
        "pattern": {
          "Regex": "\\\\[a-zA-Z]+"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "[MASK]": 4,
      "!": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "A": 35,
      "B": 36,
      "C": 37,
      "D": 38,
      "E": 39,
      "F": 40,
      "G": 41,
      "H": 42,
      "I": 43,
      "J": 44,
      "K": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "Q": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "^": 64,
      "_": 65,
      "`": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "j": 76,
      "k": 77,
      "l": 78,
      "m": 79,
      "n": 80,
      "o": 81,
      "p": 82,
      "q": 83,
      "r": 84,
      "s": 85,
      "t": 86,
      "u": 87,
      "v": 88,
      "w": 89,
      "x": 90,
      "y": 91,
      "z": 92,
      "{": 93,
      "|": 94,
      "}": 95,
      "~": 96,
      "¢": 97,
      "°": 98,
      "Å": 99,
      "é": 100,
      "ü": 101,
      "ā": 102,
      "ć": 103,
      "č": 104,
      "ṇ": 105,
      "–": 106,
      "‘": 107,
      "’": 108,
      "“": 109,
      "”": 110,
      "‰": 111,
      "_{": 112,
      "}}": 113,
      "^{": 114,
      "ra": 115,
      "fra": 116,
      "frac": 117,
      "\\frac": 118,
      "ma": 119,
      "}{": 120,
      "mat": 121,
      "2}": 122,
      "in": 123,
      "math": 124,
      "\\math": 125,
      "\\t": 126,
      "\\s": 127,
      "1}": 128,
      "\\p": 129,
      "al": 130,
      "ta": 131,
      "rt": 132,
      "ot": 133,
      "\\b": 134,
      "\\mathb": 135,
      "_{i": 136,
      "\\c": 137,
      "^{2}": 138,
      "dot": 139,
      "\\l": 140,
      "me": 141,
      "\\in": 142,
      "}(": 143,
      "})": 144,
      "{1": 145,
      "\\o": 146,
      "}}{": 147,
      "\\mathbf": 148,
      "_{1}": 149,
      "eta": 150,
      "ig": 151,
      "ha": 152,
      "ex": 153,
      "\\,": 154,
      "}=": 155,
      "}^{": 156,
      "am": 157,
      "ext": 158,
      "\\text": 159,
      "_{n": 160,
      "\\cdot": 161,
      "00": 162,
      "x}": 163,
      "2}}": 164,
      "(x": 165,
      "\\sq": 166,
      "\\sqrt": 167,
      "_{0": 168,
      "ar": 169,
      "art": 170,
      "_{2}": 171,
      "rm": 172,
      "ial": 173,
      "artial": 174,
      "\\partial": 175,
      ")=": 176,
      "\\e": 177,
      "{1}{": 178,
      "le": 179,
      "\\su": 180,
      "\\m": 181,
      "\\v": 182,
      "hi": 183,
      "ri": 184,
      "pha": 185,
      "\\al": 186,
      "\\mathrm": 187,
      "\\alpha": 188,
      "er": 189,
      "matri": 190,
      "si": 191,
      "\\\\": 192,
      "ty": 193,
      "\\sum": 194,
      "_{i}": 195,
      "nd": 196,
      "na": 197,
      "or": 198,
      "ng": 199,
      "\\pi": 200,
      "-1": 201,
      "el": 202,
      "da": 203,
      "heta": 204,
      "\\dot": 205,
      "eg": 206,
      "_{k": 207,
      "elta": 208,
      "{d": 209,
      "\\theta": 210,
      "\\mu": 211,
      "ga": 212,
      "\\ti": 213,
      "ngle": 214,
      "mega": 215,
      "matrix}": 216,
      "igma": 217,
      "\\int": 218,
      "amb": 219,
      "ambda": 220,
      "^{-": 221,
      "\\op": 222,
      "\\to": 223,
      "\\g": 224,
      "},": 225,
      "egin": 226,
      "\\begin": 227,
      "\\end": 228,
      "_{j": 229,
      "amma": 230,
      "rat": 231,
      "\\lambda": 232,
      "\\sigma": 233,
      "mes": 234,
      "erat": 235,
      "name": 236,
      "erator": 237,
      "\\operator": 238,
      "\\operatorname": 239,
      "\\var": 240,
      "ver": 241,
      "\\dots": 242,
      "ro": 243,
      "^{n": 244,
      "\\over": 245,
      "}+": 246,
      "{b": 247,
      "(1": 248,
      "lo": 249,
      "^{2}}": 250,
      "ol": 251,
      "{p": 252,
      "t)": 253,
      "\\n": 254,
      "\\inf": 255,
      "hat": 256,
      "\\hat": 257,
      "\\beta": 258,
      "\\infty": 259,
      "={": 260,
      "qu": 261,
      "3}": 262,
      "\\r": 263,
      "\\mathbb": 264,
      "\\d": 265,
      "\\{": 266,
      "\\omega": 267,
      "(x)": 268,
      "}}}": 269,
      "\\le": 270,
      "_{1": 271,
      "t}": 272,
      "ho": 273,
      "cal": 274,
      "{2": 275,
      "^{2": 276,
      "\\mathcal": 277,
      "11": 278,
      "33": 279,
      "\\rho": 280,
      "lon": 281,
      "psi": 282,
      "psilon": 283,
      "44": 284,
      "\\times": 285,
      "ed": 286,
      "99": 287,
      ")}": 288,
      "\\gamma": 289,
      "ad": 290,
      "66": 291,
      "55": 292,
      "77": 293,
      "({": 294,
      "\\phi": 295,
      "88": 296,
      "+1": 297,
      "\\}": 298,
      "_{0}": 299,
      "-1}": 300,
      "22": 301,
      "\\ta": 302,
      "=1}": 303,
      "\\ra": 304,
      "\\rangle": 305,
      "}})": 306,
      "\\co": 307,
      "\\D": 308,
      "quad": 309,
      "\\Delta": 310,
      "ap": 311,
      "=0": 312,
      "0000": 313,
      "_{1},": 314,
      "_{n}": 315,
      "ine": 316,
      "\\sin": 317,
      "line": 318,
      "{R": 319,
      "(n": 320,
      "\\cos": 321,
      "\\delta": 322,
      "{bmatrix}": 323,
      "}_{": 324,
      "-{": 325,
      "om": 326,
      "se": 327,
      "\\varp": 328,
      "\\psi": 329,
      "\\tau": 330,
      "\\big": 331,
      "\\nu": 332,
      "{x": 333,
      "f(": 334,
      "\\varphi": 335,
      "{A": 336,
      "ds": 337,
      "\\lo": 338,
      "{n": 339,
      "\\P": 340,
      "r}": 341,
      ")^{": 342,
      "\\;": 343,
      "e^{": 344,
      "la": 345,
      "{a": 346,
      "{c": 347,
      "angle": 348,
      "0.": 349,
      "de": 350,
      "^{n}": 351,
      "ec": 352,
      "im": 353,
      "dx": 354,
      ")}{": 355,
      "\\log": 356,
      "sty": 357,
      "style": 358,
      "0,": 359,
      "\\cdots": 360,
      "k}": 361,
      "app": 362,
      "ll": 363,
      "\\overline": 364,
      "\\quad": 365,
      "_{m": 366,
      "^{2}}{": 367,
      "}(x": 368,
      "^{2}+": 369,
      "^{-1}": 370,
      "lde": 371,
      "\\tilde": 372,
      "0&": 373,
      "mb": 374,
      "epsilon": 375,
      "\\varepsilon": 376,
      "ign": 377,
      "(2": 378,
      "4}": 379,
      "\\langle": 380,
      "\\bol": 381,
      "{al": 382,
      "{3": 383,
      "ymb": 384,
      "ymbol": 385,
      "{align": 386,
      "(t)": 387,
      "dsymbol": 388,
      "\\boldsymbol": 389,
      "{v": 390,
      "_{t": 391,
      "_{p": 392,
      "{aligned": 393,
      "))": 394,
      "+1}": 395,
      "{E": 396,
      "inom": 397,
      "\\binom": 398,
      "{B": 399,
      "(a": 400,
      "{pmatrix}": 401,
      "}}=": 402,
      "}{1": 403,
      "n}": 404,
      "}{d": 405,
      "}}_{": 406,
      "+{": 407,
      "{C": 408,
      "}}(": 409,
      "T}": 410,
      "\\vec": 411,
      "=1}^{": 412,
      "{P": 413,
      "),": 414,
      "^{3": 415,
      "\\ge": 416,
      "}-": 417,
      "\\|": 418,
      "_{x": 419,
      "e^{-": 420,
      "\\bar": 421,
      "_{a": 422,
      "row": 423,
      "bla": 424,
      "tar": 425,
      "\\na": 426,
      "\\nabla": 427,
      "0}": 428,
      "\\!": 429,
      "_{k}": 430,
      "}={": 431,
      "_{3": 432,
      "Gamma": 433,
      "_{j}": 434,
      "(X": 435,
      "set": 436,
      "\\Gamma": 437,
      "y)": 438,
      "{S": 439,
      "_{2": 440,
      "\\O": 441,
      "s}": 442,
      "\\Omega": 443,
      "\\ln": 444,
      "&=": 445,
      "{x}": 446,
      "\\eta": 447,
      "-2": 448,
      "{d}": 449,
      "10": 450,
      "}}^{": 451,
      "\\pro": 452,
      "{m": 453,
      "(x,": 454,
      "-1)": 455,
      "\\ex": 456,
      "x^{": 457,
      "{r": 458,
      "1,": 459,
      "id": 460,
      "{e": 461,
      "\\x": 462,
      "tarrow": 463,
      "{(": 464,
      "{H": 465,
      "N}": 466,
      "matrix": 467,
      "{F": 468,
      "_{0}^{": 469,
      "y}": 470,
      "igh": 471,
      "j}": 472,
      "/2": 473,
      "\\epsilon": 474,
      "(1-": 475,
      "\\textstyle": 476,
      "{s": 477,
      "{f": 478,
      "{4": 479,
      "rox": 480,
      "ge": 481,
      "}}}}": 482,
      "approx": 483,
      "\\approx": 484,
      "(t": 485,
      "\\rm": 486,
      "imes": 487,
      "_{c": 488,
      "i}": 489,
      "}{2": 490,
      "otimes": 491,
      "_{i})": 492,
      "\\ma": 493,
      "\\otimes": 494,
      "\\pm": 495,
      "\\lim": 496,
      "{u": 497,
      "\\prod": 498,
      "\\mid": 499,
      "}},": 500,
      "ightarrow": 501,
      "{L": 502,
      "(z": 503,
      "{R}": 504,
      "\\xi": 505,
      "m}": 506,
      "{1}{2}}": 507,
      "_{A": 508,
      "st": 509,
      "edge": 510,
      "ir": 511,
      "(A": 512,
      "wedge": 513,
      "iv": 514,
      "}}}{": 515,
      "(s": 516,
      "{T": 517,
      "_{3}": 518,
      "\\Phi": 519,
      "_{2}}": 520,
      "^{2})": 521,
      "us": 522,
      "^{*": 523,
      "_{n})": 524,
      "\\wedge": 525,
      "^{1": 526,
      "_{2},": 527,
      "b}": 528,
      "(k": 529,
      "irc": 530,
      "=0}^{": 531,
      "\\exp": 532,
      ")={": 533,
      "{Z": 534,
      "_{s": 535,
      "\\ell": 536,
      "\\circ": 537,
      ":=": 538,
      "}}={": 539,
      "{X": 540,
      "{k": 541,
      ")+": 542,
      "bset": 543,
      "\\subset": 544,
      "z}": 545,
      "{5": 546,
      "f(x)": 547,
      "}{2}}": 548,
      "_{r": 549,
      "pt": 550,
      "it": 551,
      "{1}{2}": 552,
      "_{x}": 553,
      "\\,d": 554,
      "^*": 555,
      "{t": 556,
      "{M": 557,
      "x)": 558,
      "{aligned}}": 559,
      "{I": 560,
      "quiv": 561,
      "up": 562,
      "{D": 563,
      "{E}": 564,
      "(p": 565,
      "\\equiv": 566,
      "1&": 567,
      "+1)": 568,
      "^{2}-": 569,
      "V_{": 570,
      "}{2}": 571,
      "[{": 572,
      "5}": 573,
      "^{3}": 574,
      "_{1}}": 575,
      "+2": 576,
      "\\k": 577,
      "sf": 578,
      "_{2})": 579,
      "frak": 580,
      "\\mathfrak": 581,
      "\\L": 582,
      "_{X": 583,
      "\\q": 584,
      "{g": 585,
      "_{0})": 586,
      "^{4": 587,
      "1-": 588,
      "\\h": 589,
      "\\f": 590,
      "rightarrow": 591,
      "\\qquad": 592,
      "{r}": 593,
      "0)": 594,
      "\\chi": 595,
      "_{B": 596,
      "{N": 597,
      "\\z": 598,
      "(r": 599,
      "appa": 600,
      "_{e": 601,
      "(-": 602,
      "{G": 603,
      "matrix}}": 604,
      "\\kappa": 605,
      "ora": 606,
      "}{3": 607,
      "=1}^{n}": 608,
      "orall": 609,
      "\\forall": 610,
      "9999": 611,
      "\\u": 612,
      "\\zeta": 613,
      "\\B": 614,
      "_{i}}": 615,
      "{aligned}": 616,
      "^{2}}}": 617,
      "\\hb": 618,
      "_{t}": 619,
      "d}": 620,
      "7777": 621,
      "3333": 622,
      "}(x)": 623,
      "c}": 624,
      "4444": 625,
      "6666": 626,
      "8888": 627,
      "{V": 628,
      "6}": 629,
      ",x": 630,
      "\\hbar": 631,
      "_{1})": 632,
      "/2}": 633,
      "5555": 634,
      "et": 635,
      "0\\\\": 636,
      "1)": 637,
      "\\ne": 638,
      "{ar": 639,
      "eq": 640,
      "}(t)": 641,
      "(y": 642,
      "{Z}": 643,
      "p}": 644,
      "{q": 645,
      "(x)=": 646,
      "12": 647,
      "z)": 648,
      "nder": 649,
      "\\,\\,": 650,
      "\\under": 651,
      "&{": 652,
      "_{i=1}^{": 653,
      "_{y": 654,
      "{O": 655,
      "=-": 656,
      "_{-": 657,
      "1.": 658,
      "\\Big": 659,
      "{y": 660,
      "1111": 661,
      "dt": 662,
      "od": 663,
      "{A}": 664,
      "flo": 665,
      "{{": 666,
      "\\max": 667,
      "\\S": 668,
      "_{f": 669,
      "floor": 670,
      "l}": 671,
      "a}": 672,
      "_{i}^{": 673,
      "(1+": 674,
      "2222": 675,
      "\\mathsf": 676,
      "(u": 677,
      "{z": 678,
      "\\sim": 679,
      "}(X": 680,
      "_{1}+": 681,
      "\\Sigma": 682,
      ")^{2}": 683,
      "(f": 684,
      "^{k": 685,
      "is": 686,
      "\\R": 687,
      "2,": 688,
      "}|": 689,
      "0&0&": 690,
      "_{ij": 691,
      "n)": 692,
      "nt": 693,
      "R_{": 694,
      "})=": 695,
      "lus": 696,
      "{i": 697,
      "}{4": 698,
      "{6": 699,
      "b)": 700,
      "{1-": 701,
      "}}+": 702,
      "{1}{2": 703,
      "{-": 704,
      "(m": 705,
      "^{1}": 706,
      "_{v": 707,
      "(i": 708,
      "]=": 709,
      "{7": 710,
      ")}}": 711,
      "\\Psi": 712,
      "ase": 713,
      "h}": 714,
      "{C}": 715,
      "000": 716,
      "^{2}=": 717,
      "1/": 718,
      "{8": 719,
      "{2}}": 720,
      "{v}": 721,
      "{Q": 722,
      "C_{": 723,
      "\\tan": 724,
      "T_{": 725,
      "')": 726,
      "\\cap": 727,
      "s}}": 728,
      "\\subseteq": 729,
      "}+{": 730,
      "_{i},": 731,
      "_{0}}": 732,
      "(n)": 733,
      "-x": 734,
      "})^{": 735,
      "_{0},": 736,
      "00000000": 737,
      "ce": 738,
      "{case": 739,
      "_{i}=": 740,
      "{arra": 741,
      "(3": 742,
      "{K": 743,
      "(c": 744,
      "E_{": 745,
      "_{ij}": 746,
      "{w": 747,
      "\\underline": 748,
      "sh": 749,
      "_{S": 750,
      "7}": 751,
      ").": 752,
      "sto": 753,
      "x^{2}": 754,
      "P(": 755,
      "_{m}": 756,
      "{B}": 757,
      "_{p}": 758,
      "e^{i": 759,
      "{e}": 760,
      "1+": 761,
      "psto": 762,
      "{10": 763,
      ",y": 764,
      "ee": 765,
      "\\mapsto": 766,
      "_{i=1}^{n}": 767,
      "L}": 768,
      "\\neg": 769,
      "_{b": 770,
      "on": 771,
      "{9": 772,
      ")-": 773,
      "y}{": 774,
      "8}": 775,
      "-1}{": 776,
      "x+": 777,
      "\\oplus": 778,
      "\\Lambda": 779,
      "_{n}(": 780,
      "''": 781,
      "_{i}(": 782,
      "-a": 783,
      "ox": 784,
      "^{i": 785,
      "\\cup": 786,
      "{P}": 787,
      "q}": 788,
      "&={": 789,
      "(v": 790,
      "\\bigg": 791,
      "x_{1}": 792,
      "f_{": 793,
      "(b": 794,
      ",n": 795,
      "_{4": 796,
      "R}": 797,
      "P_{": 798,
      "\\min": 799,
      "^{4}": 800,
      "(q": 801,
      "_{1}}{": 802,
      "}=0": 803,
      "t}}": 804,
      "}({": 805,
      "=1": 806,
      "_{i,": 807,
      "gg": 808,
      "{u}": 809,
      "{h": 810,
      ",b": 811,
      "{p}": 812,
      "min": 813,
      "\\vee": 814,
      "{H}": 815,
      "pla": 816,
      "f(x": 817,
      "\\,dx": 818,
      "9}": 819,
      "(S": 820,
      "dagg": 821,
      "dagger": 822,
      "_{d": 823,
      "2^{": 824,
      "+b": 825,
      "}}+{": 826,
      "^{*}": 827,
      "{X}": 828,
      "\\,{": 829,
      "(g": 830,
      "g}": 831,
      "ispla": 832,
      "{T}": 833,
      "(T": 834,
      "e}": 835,
      "isplay": 836,
      "\\display": 837,
      "\\displaystyle": 838,
      "x_{2}": 839,
      "\\dagger": 840,
      "-k": 841,
      "cri": 842,
      "}{n": 843,
      "_{N": 844,
      "16": 845,
      "_{2}}{": 846,
      "15": 847,
      "cript": 848,
      "_{n-1}": 849,
      "C}": 850,
      "minus": 851,
      "-1)^{": 852,
      "s)": 853,
      ".5": 854,
      "}^": 855,
      "F_{": 856,
      "B)": 857,
      "(0,": 858,
      "p_{": 859,
      "^{5": 860,
      ",{": 861,
      "_{n}=": 862,
      "\\not": 863,
      "[0,": 864,
      "criptstyle": 865,
      "}}{1": 866,
      "2}}{": 867,
      "=2": 868,
      "ft": 869,
      "_{j})": 870,
      "_{i}}{": 871,
      ")]": 872,
      "|x": 873,
      "I_{": 874,
      "{2}": 875,
      "[x": 876,
      "|^{2}": 877,
      "(d": 878,
      "_{k})": 879,
      "A_{": 880,
      "-i": 881,
      "box": 882,
      "13": 883,
      "{a}": 884,
      "\\mbox": 885,
      "\\scriptstyle": 886,
      "{F}": 887,
      "~~": 888,
      "\\ar": 889,
      "ist": 890,
      "{2}{": 891,
      "{U": 892,
      "dots": 893,
      "}^{2}": 894,
      "1\\\\": 895,
      "x=": 896,
      "_{1}=": 897,
      "(P": 898,
      "-3": 899,
      "0}{": 900,
      "}(t": 901,
      "(N": 902,
      "{Bmatrix}": 903,
      "(4": 904,
      "^{+": 905,
      "{o": 906,
      "14": 907,
      "{matrix}": 908,
      "a)": 909,
      "{|": 910,
      "_{z": 911,
      "[X": 912,
      "A)": 913,
      "_{n+1}": 914,
      "}]": 915,
      "{bmatrix}}": 916,
      "25": 917,
      "(M": 918,
      "}{dt": 919,
      "(x,y)": 920,
      "}}]": 921,
      "1}{": 922,
      "}}\\": 923,
      "(x,y": 924,
      "^{k}": 925,
      "p)": 926,
      "x_{i}": 927,
      "}}}}}": 928,
      "'=": 929,
      ",t": 930,
      "_{12}": 931,
      "S_{": 932,
      ")=0": 933,
      "{N}": 934,
      "(s)": 935,
      "P}": 936,
      "(E": 937,
      "3}}": 938,
      "(1)": 939,
      "_{0}}{": 940,
      "_{0}(": 941,
      "\\cong": 942,
      "k_{": 943,
      "\\,\\!": 944,
      "\\rfloor": 945,
      "\\Rightarrow": 946,
      "_{A}": 947,
      "_{n}^{": 948,
      "k)": 949,
      "{x}}": 950,
      "\\bigl": 951,
      "}{dt}": 952,
      "(z)": 953,
      "*}": 954,
      "&&": 955,
      "\\lfloor": 956,
      "\\bigr": 957,
      "\\notin": 958,
      ",\\": 959,
      "^{T}": 960,
      "(R": 961,
      "bf": 962,
      "[n": 963,
      "I}": 964,
      "2}{": 965,
      "{n}{": 966,
      "its": 967,
      "{W": 968,
      ",v": 969,
      "=1,": 970,
      "^{0": 971,
      ",t)": 972,
      "ists": 973,
      "!}": 974,
      "{Y": 975,
      "V}": 976,
      "18": 977,
      "c^{2}}": 978,
      "x_{": 979,
      "\\\\[": 980,
      "^{2}}{2": 981,
      "_{n}}": 982,
      "\\exists": 983,
      "D}": 984,
      "ftrightarrow": 985,
      "at": 986,
      "_{a}^{": 987,
      "]}": 988,
      "_{a}": 989,
      "\\\\&=": 990,
      "{in": 991,
      "|}": 992,
      "{1}{4": 993,
      "\\textbf": 994,
      "_{r}": 995,
      "{k}": 996,
      "M}": 997,
      "-1}}": 998,
      "f}": 999,
      "\\Pi": 1000,
      "_{B}": 1001,
      "\\set": 1002,
      "\\setminus": 1003,
      "^{7": 1004,
      "\\det": 1005,
      "\\;\\;": 1006,
      "20": 1007,
      "2.": 1008,
      "y=": 1009,
      "_{s}": 1010,
      "'}": 1011,
      "(Y": 1012,
      "}}-": 1013,
      "_{l": 1014,
      "(t)=": 1015,
      "{J": 1016,
      "24": 1017,
      "A}": 1018,
      "\\!\\!": 1019,
      "\\limits": 1020,
      "_{c}": 1021,
      "c)": 1022,
      "36": 1023,
      "ngrightarrow": 1024,
      "\\arc": 1025,
      "{1+": 1026,
      "B}": 1027,
      "^{a": 1028,
      "}^{2}}": 1029,
      "r)": 1030,
      "ntom": 1031,
      "3,": 1032,
      "_{y}": 1033,
      "f)": 1034,
      "})}": 1035,
      "u}": 1036,
      "r^{2}": 1037,
      "_{0}+": 1038,
      "\\T": 1039,
      "n}}": 1040,
      "3.": 1041,
      "q)": 1042,
      "(G": 1043,
      "^{p": 1044,
      "0.5": 1045,
      "}=-": 1046,
      "_{k=0}^{": 1047,
      "x}{": 1048,
      "_{11}": 1049,
      "_{2}=": 1050,
      "ul": 1051,
      "17": 1052,
      "(B": 1053,
      "(y)": 1054,
      "E}": 1055,
      "(}": 1056,
      ",m": 1057,
      "il": 1058,
      "{A}}_{": 1059,
      "\\sup": 1060,
      "_{q": 1061,
      "|{": 1062,
      "{S}": 1063,
      ",a": 1064,
      "_{j}}": 1065,
      "_{0}=": 1066,
      "S}": 1067,
      "\\vpha": 1068,
      "\\vphantom": 1069,
      "_{L": 1070,
      "_{o": 1071,
      "_{1}-": 1072,
      "\\Theta": 1073,
      "pt]": 1074,
      "\\vdots": 1075,
      "\\{x": 1076,
      "_{n=1}^{": 1077,
      "1]": 1078,
      "(C": 1079,
      "a_{1}": 1080,
      "(w": 1081,
      "op": 1082,
      "{y}": 1083,
      "30": 1084,
      "_{X}": 1085,
      "\\},": 1086,
      "2)": 1087,
      "K}": 1088,
      "ab": 1089,
      "19": 1090,
      "f'": 1091,
      "\\\\&": 1092,
      "}}\\,": 1093,
      "\\bigc": 1094,
      "{cases}}": 1095,
      ",Y": 1096,
      "-b": 1097,
      "_{w": 1098,
      "80": 1099,
      "(0": 1100,
      "H}": 1101,
      "\\\\{": 1102,
      "^{6": 1103,
      "A=": 1104,
      "{array}{": 1105,
      "(X)": 1106,
      ",k": 1107,
      "int": 1108,
      "^{2}(": 1109,
      "\\textrm": 1110,
      "}^{-1}": 1111,
      "^{m": 1112,
      "-4": 1113,
      "27": 1114,
      "5}}": 1115,
      ">0": 1116,
      "_{4}": 1117,
      "60": 1118,
      "64": 1119,
      "(h": 1120,
      "+c": 1121,
      ",z": 1122,
      "v}": 1123,
      "x^{2}}": 1124,
      "mp": 1125,
      "_{h": 1126,
      ",j": 1127,
      ")|": 1128,
      "\\mathit": 1129,
      "-y": 1130,
      "{bmatrix": 1131,
      "_{T": 1132,
      "0.0": 1133,
      "tan": 1134,
      "ac": 1135,
      "3}{": 1136,
      "}}({": 1137,
      "\\Pr": 1138,
      "=(": 1139,
      "-2}": 1140,
      "^{3}+": 1141,
      "}}})": 1142,
      ",X": 1143,
      "}{dx}": 1144,
      "_{g": 1145,
      "(x_{1},": 1146,
      "(1,": 1147,
      "999": 1148,
      "^{n-1}": 1149,
      "x^{2}+": 1150,
      "}}|": 1151,
      "){": 1152,
      "(0)": 1153,
      "_{n},": 1154,
      "_{z}": 1155,
      ",\\,": 1156,
      "t}]": 1157,
      "\\sma": 1158,
      "for": 1159,
      "{b}": 1160,
      "_{j=1}^{": 1161,
      "c^{2}": 1162,
      "\\Lo": 1163,
      "let": 1164,
      "f}{": 1165,
      "{l": 1166,
      "{n}": 1167,
      "6}{": 1168,
      "a^{2}": 1169,
      "{Q}": 1170,
      "28": 1171,
      "\\{1": 1172,
      "^{3}}": 1173,
      "(V": 1174,
      "-1,": 1175,
      "+n": 1176,
      "+3": 1177,
      "(L": 1178,
      ")/": 1179,
      ".0": 1180,
      "H_{": 1181,
      "}},{": 1182,
      "K_{": 1183,
      "and": 1184,
      "_{1}^{": 1185,
      "X}": 1186,
      "_{e}": 1187,
      "34": 1188,
      "a_{2}": 1189,
      "{T}}": 1190,
      "{x}{": 1191,
      "}}{2": 1192,
      "-m": 1193,
      "ullet": 1194,
      "_{i=0}^{": 1195,
      "}^{n}": 1196,
      "}(x)=": 1197,
      "D_{": 1198,
      "\\bullet": 1199,
      "_{k}}": 1200,
      "[{t}]": 1201,
      "\\smash": 1202,
      "_{k}(": 1203,
      "37": 1204,
      "re": 1205,
      "444": 1206,
      "g_{": 1207,
      "{f}": 1208,
      "(j": 1209,
      "\\,,": 1210,
      "dy": 1211,
      "T)": 1212,
      "})}{": 1213,
      "94": 1214,
      "_{k=1}^{": 1215,
      "x,": 1216,
      "O(": 1217,
      "u}{": 1218,
      "+i": 1219,
      "a_{n}": 1220,
      ",q": 1221,
      "}=1": 1222,
      "ut": 1223,
      "y}}": 1224,
      "}{c": 1225,
      "(F": 1226,
      "^+": 1227,
      "x}}": 1228,
      "{pmatrix}}": 1229,
      "38": 1230,
      "(I": 1231,
      "35": 1232,
      "(-1)^{": 1233,
      ".7": 1234,
      "mod": 1235,
      "u)": 1236,
      "_{n=0}^{": 1237,
      "/4": 1238,
      "{M}": 1239,
      "777": 1240,
      "\\ce": 1241,
      "6}}": 1242,
      "-c": 1243,
      "^{i}": 1244,
      "e^{-i": 1245,
      "a_{": 1246,
      "r_{": 1247,
      "_{0}^{1}": 1248,
      "\\pmod": 1249,
      "555": 1250,
      "{L}": 1251,
      "888": 1252,
      "{I}": 1253,
      "^{n}}": 1254,
      "y^{2}": 1255,
      "})^{2}": 1256,
      "||": 1257,
      "(A)": 1258,
      "=1}^{n": 1259,
      "g(x)": 1260,
      "mpty": 1261,
      "{a}{": 1262,
      "(k)": 1263,
      "(a)": 1264,
      "(D": 1265,
      "_{2}+": 1266,
      "222": 1267,
      "^{3}}{": 1268,
      "S=": 1269,
      "}(X)": 1270,
      "{cases}": 1271,
      "mptyset": 1272,
      "\\emptyset": 1273,
      "111": 1274,
      "\\propt": 1275,
      "\\propto": 1276,
      "_{i+1}": 1277,
      "M_{": 1278,
      ".4": 1279,
      "ime": 1280,
      "000000": 1281,
      "v_{": 1282,
      "_{i}-": 1283,
      "co": 1284,
      "_{3})": 1285,
      "',": 1286,
      "dash": 1287,
      "/2)": 1288,
      "{1}{n": 1289,
      "G}": 1290,
      "(K": 1291,
      "333": 1292,
      "}{m": 1293,
      "_{S}": 1294,
      "M)": 1295,
      "/3": 1296,
      "(n-1)": 1297,
      "R)": 1298,
      "{if": 1299,
      "2&": 1300,
      "^{9": 1301,
      "}}-{": 1302,
      "{D}": 1303,
      "[A": 1304,
      "_{j}^{": 1305,
      "L_{": 1306,
      "}{k": 1307,
      "\\,.": 1308,
      "\\{0,": 1309,
      "(2)": 1310,
      ".8": 1311,
      "666": 1312,
      "100": 1313,
      "50": 1314,
      "=0,": 1315,
      "\\bmod": 1316,
      "\\star": 1317,
      "{100000000": 1318,
      "{4}{": 1319,
      "0\\\\0&": 1320,
      "f(x)=": 1321,
      "}(n": 1322,
      "\\i": 1323,
      "29": 1324,
      "i)": 1325,
      "+1}}": 1326,
      "(H": 1327,
      "{s}": 1328,
      "^{0}": 1329,
      "arrow": 1330,
      "{1}": 1331,
      "}^{n": 1332,
      "}.": 1333,
      "{d^{2}": 1334,
      "rel": 1335,
      "],": 1336,
      "69": 1337,
      "}{a": 1338,
      "m_{": 1339,
      "(U": 1340,
      "(e": 1341,
      "}{r": 1342,
      "(a,": 1343,
      "}(z": 1344,
      "{}": 1345,
      "])": 1346,
      "{m}": 1347,
      "+}": 1348,
      ",w": 1349,
      "a_{i}": 1350,
      "^{n})": 1351,
      "{c}": 1352,
      "-p": 1353,
      "cc": 1354,
      "+k": 1355,
      "+4": 1356,
      "T}{": 1357,
      "N_{": 1358,
      "_{a}^{b}": 1359,
      "\\textsf": 1360,
      "ceil": 1361,
      "\\{1,": 1362,
      "(x-": 1363,
      ",p": 1364,
      "|=": 1365,
      "F}": 1366,
      "d_{": 1367,
      "}{10": 1368,
      "8}}": 1369,
      "\\bigcup": 1370,
      "10^{": 1371,
      "_{22}": 1372,
      "39": 1373,
      "}}{n": 1374,
      "xy": 1375,
      "_{k}^{": 1376,
      "c_{1}": 1377,
      "65": 1378,
      "\\vdash": 1379,
      "^{m}": 1380,
      "en": 1381,
      ".9": 1382,
      "67": 1383,
      "{B}}": 1384,
      "|z": 1385,
      "^{j": 1386,
      "((": 1387,
      "_{C": 1388,
      "10^{-": 1389,
      "erp": 1390,
      "of": 1391,
      "-n": 1392,
      "}}{c": 1393,
      "x_{n}": 1394,
      "}(a": 1395,
      "{A}}": 1396,
      "{q}": 1397,
      "dz": 1398,
      "v)": 1399,
      "x'": 1400,
      "\\,dt": 1401,
      "X)": 1402,
      "_{v}": 1403,
      "T}}": 1404,
      "_{3},": 1405,
      "[n]": 1406,
      "C)": 1407,
      "1}}": 1408,
      "y_{1}": 1409,
      "Y}": 1410,
      "\\perp": 1411,
      "}),": 1412,
      "f(t)": 1413,
      "+a": 1414,
      "\\cosh": 1415,
      "!}}": 1416,
      "_{b}": 1417,
      "J}": 1418,
      "P=": 1419,
      "}{5": 1420,
      "her": 1421,
      "(r)": 1422,
      "(5": 1423,
      "-1&": 1424,
      "{[": 1425,
      "_{k}=": 1426,
      "{p}}": 1427,
      ".}": 1428,
      ",s": 1429,
      "^{2}{": 1430,
      "_{f}": 1431,
      "]}{": 1432,
      "^{2}}}}": 1433,
      "_{k+1}": 1434,
      "[a": 1435,
      "\\longrightarrow": 1436,
      "g)": 1437,
      "+d": 1438,
      ",d": 1439,
      "_{R": 1440,
      "\\sinh": 1441,
      "{z}": 1442,
      "_{2}-": 1443,
      "\\Z": 1444,
      "1\\": 1445,
      "}^{2}}{": 1446,
      "m)": 1447,
      "^{1/": 1448,
      "p_{i}": 1449,
      "ftarrow": 1450,
      "g(": 1451,
      "}}{2}": 1452,
      "_{1}(": 1453,
      ",i": 1454,
      "n_{": 1455,
      "}{100000000": 1456,
      "c_{": 1457,
      "^{2}/": 1458,
      "}}{4": 1459,
      "\\sime": 1460,
      "\\simeq": 1461,
      "55555": 1462,
      "{x})": 1463,
      "(x+": 1464,
      "_{t})": 1465,
      "{e^{": 1466,
      "t}{": 1467,
      "X_{": 1468,
      "r=": 1469,
      "3)": 1470,
      "=\\{": 1471,
      ",c": 1472,
      "44444": 1473,
      "68": 1474,
      "\\arctan": 1475,
      "\\cot": 1476,
      "_{i-1}": 1477,
      "f:": 1478,
      "{K}": 1479,
      "_{1}^{2}": 1480,
      "{pmatrix": 1481,
      "_{t}=": 1482,
      "_{21}": 1483,
      "ck": 1484,
      "}})=": 1485,
      "}\\": 1486,
      "ion": 1487,
      "|X": 1488,
      "m}}": 1489,
      "|}{": 1490,
      "_{i=1}^{N}": 1491,
      "{1}{1": 1492,
      "A^{": 1493,
      "75": 1494,
      "99999": 1495,
      "\\leftarrow": 1496,
      "88888": 1497,
      "A,": 1498,
      "_{1,": 1499,
      "{n}}": 1500,
      "_{2}(": 1501,
      "p_{1}": 1502,
      "x_{2},": 1503,
      "90": 1504,
      ")\\,": 1505,
      "77777": 1506,
      "V_": 1507,
      "32": 1508,
      "=1}^": 1509,
      "{for": 1510,
      "_{i,j": 1511,
      "r}(": 1512,
      "{1}{3": 1513,
      "-t": 1514,
      "333333": 1515,
      "\\%": 1516,
      "}}{d": 1517,
      ")=1": 1518,
      "y'": 1519,
      "E[": 1520,
      "_{P": 1521,
      "666666": 1522,
      "n=": 1523,
      "-z": 1524,
      "f^{-1}": 1525,
      "999999": 1526,
      "(f)": 1527,
      "(}{": 1528,
      "40": 1529,
      "_{M": 1530,
      "}[": 1531,
      "888888": 1532,
      "p(": 1533,
      "(X,": 1534,
      "(n+1)": 1535,
      "444444": 1536,
      "{F}}": 1537,
      "r}}": 1538,
      "_{u": 1539,
      "70": 1540,
      "22222": 1541,
      "|A": 1542,
      "_{n}}{": 1543,
      "{g}": 1544,
      "4}{": 1545,
      "|<": 1546,
      "{d}{d": 1547,
      "33333": 1548,
      "h)": 1549,
      "X^{": 1550,
      "r^{2}}": 1551,
      "a=": 1552,
      "777777": 1553,
      "0\\\\0&0&": 1554,
      "{j": 1555,
      "es": 1556,
      "x^{3}": 1557,
      "du": 1558,
      "+2}": 1559,
      "^{2}}{4": 1560,
      "}\\,": 1561,
      "t)=": 1562,
      "/{": 1563,
      "\\top": 1564,
      "}))": 1565,
      "E)": 1566,
      "\\mod": 1567,
      "{Hom": 1568,
      "7}}": 1569,
      "(z)=": 1570,
      "\\Bigg": 1571,
      "x-": 1572,
      "45": 1573,
      "{O}": 1574,
      "p}{": 1575,
      "_{k-1}": 1576,
      "66666": 1577,
      "L}{": 1578,
      "V}{": 1579,
      "sla": 1580,
      "48": 1581,
      "00000": 1582,
      "{dy": 1583,
      "f,": 1584,
      "v=": 1585,
      "}(n)": 1586,
      "F(": 1587,
      "z=": 1588,
      "{r}}": 1589,
      "^{2},": 1590,
      "{G}": 1591,
      "555555": 1592,
      "}(1-": 1593,
      "{tr}": 1594,
      "Y)": 1595,
      "1\\}": 1596,
      "&-": 1597,
      ")\\": 1598,
      "g^{": 1599,
      "}})^{": 1600,
      "f^{": 1601,
      "})+": 1602,
      "artheta": 1603,
      "\\vartheta": 1604,
      "11111": 1605,
      "E=": 1606,
      "ow": 1607,
      "}).": 1608,
      "{3}{": 1609,
      "}{1-": 1610,
      "O}": 1611,
      "}=2": 1612,
      "[0,1]": 1613,
      "4,": 1614,
      "V)": 1615,
      "_{2}^{": 1616,
      "(|": 1617,
      "N}}": 1618,
      "sin": 1619,
      "\\Longrightarrow": 1620,
      "_{2}}}": 1621,
      "{dx": 1622,
      "Z_{": 1623,
      "(1/": 1624,
      ")^{-1}": 1625,
      "=0}^": 1626,
      "{Sp": 1627,
      "if": 1628,
      "Q_{": 1629,
      "_{k=1}^{n}": 1630,
      "s_{": 1631,
      "_{i=1}^{n": 1632,
      "^{d": 1633,
      "_{t}^{": 1634,
      "h_{": 1635,
      "{w}": 1636,
      "U}": 1637,
      "3&": 1638,
      "\\\\0&": 1639,
      "}}.": 1640,
      "_{10": 1641,
      "_{i}}}": 1642,
      "_{0}^": 1643,
      "n}{": 1644,
      "n^{": 1645,
      "\\}.": 1646,
      "{V}": 1647,
      "e_{": 1648,
      "{i}": 1649,
      "z^{": 1650,
      "_{m})": 1651,
      "}(s": 1652,
      "V=": 1653,
      "ar}": 1654,
      "7}{": 1655,
      "{0": 1656,
      "y_{i}": 1657,
      "\\#": 1658,
      "{5}{": 1659,
      "1&1&": 1660,
      "{3}": 1661,
      "+q": 1662,
      "U_{": 1663,
      "=0.": 1664,
      "}}{k": 1665,
      "5}{": 1666,
      "(1-{": 1667,
      "G_{": 1668,
      "ep": 1669,
      "26": 1670,
      "n-1}": 1671,
      "p=": 1672,
      "^-": 1673,
      "t+": 1674,
      ")^{3": 1675,
      "f=": 1676,
      "_{j},": 1677,
      "}(x,": 1678,
      "X_{i}": 1679,
      "S)": 1680,
      "t=": 1681,
      "\\}}": 1682,
      "_{0}}}": 1683,
      "^{-2}": 1684,
      "~{": 1685,
      "(x))": 1686,
      "^{1/2}": 1687,
      "B_{": 1688,
      "^{8": 1689,
      "{aligned}{": 1690,
      "(2n": 1691,
      "'}{": 1692,
      "x_{0}": 1693,
      "{d}{": 1694,
      "_{j}=": 1695,
      "^{p}": 1696,
      "}^{1}": 1697,
      "R=": 1698,
      "X=": 1699,
      "e}}": 1700,
      "-2)": 1701,
      "y,": 1702,
      "-(": 1703,
      "-r": 1704,
      "]+": 1705,
      "{and": 1706,
      "{matrix}}": 1707,
      "}{3}}": 1708,
      "v}{": 1709,
      "o}": 1710,
      "78": 1711,
      "f_{1}": 1712,
      "(l": 1713,
      "N)": 1714,
      "mall": 1715,
      "c_{2}": 1716,
      "e^{2": 1717,
      "\\angle": 1718,
      "|_{": 1719,
      "_{0}^{t}": 1720,
      "i}}": 1721,
      ",r": 1722,
      "p(x)": 1723,
      ",u": 1724,
      "23": 1725,
      "_{1}}}": 1726,
      "95": 1727,
      ":{": 1728,
      "x.": 1729,
      "9}{": 1730,
      "_{p}(": 1731,
      ",x_{n})": 1732,
      "\\{{": 1733,
      "G)": 1734,
      "{small": 1735,
      "\\|_{": 1736,
      "}{1+": 1737,
      "w}": 1738,
      "00}": 1739,
      "all": 1740,
      "1/2": 1741,
      "9}}": 1742,
      "2}}}": 1743,
      "{3}}": 1744,
      "_{n,": 1745,
      "^{2}}{c^{2}}": 1746,
      "F=": 1747,
      "_{k},": 1748,
      "|a": 1749,
      "|+": 1750,
      "_{x}(": 1751,
      "{U}": 1752,
      "}}}={": 1753,
      "(n)=": 1754,
      "\\})": 1755,
      "f(z": 1756,
      "(p)": 1757,
      "ur": 1758,
      "ngleftrightarrow": 1759,
      "a^{": 1760,
      "(-1)": 1761,
      "\\,\\,\\,": 1762,
      "!}{": 1763,
      "{ad": 1764,
      "race": 1765,
      "97": 1766,
      "y_{2}": 1767,
      "E(": 1768,
      "Q)": 1769,
      "th": 1770,
      "b^{2}": 1771,
      "ia": 1772,
      "]{": 1773,
      "0\\}": 1774,
      "_{D": 1775,
      "b_{1}": 1776,
      "\\leftrightarrow": 1777,
      "111111": 1778,
      "_{ab": 1779,
      "&0&": 1780,
      "(i)": 1781,
      "S(": 1782,
      "I)": 1783,
      "p_{2}": 1784,
      "x_{1},": 1785,
      "{R}^{": 1786,
      "p,": 1787,
      "_{G": 1788,
      "ic": 1789,
      "{V_{": 1790,
      ")=-": 1791,
      "63": 1792,
      "z}{": 1793,
      "_{3}}": 1794,
      "{9}{": 1795,
      "+x": 1796,
      "1}}{": 1797,
      "p}}": 1798,
      "+m": 1799,
      "(1)}": 1800,
      "(x)}{": 1801,
      "RT": 1802,
      "{de": 1803,
      "'(": 1804,
      "}^{-": 1805,
      "000}{": 1806,
      "{10000": 1807,
      "_{j}(": 1808,
      "222222": 1809,
      "\\bigop": 1810,
      "(u)": 1811,
      "\\bigoplus": 1812,
      "(t,": 1813,
      "a_{0}": 1814,
      "}=(": 1815,
      "_{i}|": 1816,
      "n}(": 1817,
      "_{j=0}^{": 1818,
      "6.": 1819,
      "C=": 1820,
      "}}[": 1821,
      "A_{1}": 1822,
      "riangle": 1823,
      "\\up": 1824,
      "_{n}(x)": 1825,
      "{0}": 1826,
      "-1/": 1827,
      "^{n+1}": 1828,
      "(x,y)=": 1829,
      "~.": 1830,
      "{c}{": 1831,
      "\\xrightarrow": 1832,
      "{array}}": 1833,
      "dV": 1834,
      "z^{2}": 1835,
      "^{s": 1836,
      "}}{2}}": 1837,
      "+B": 1838,
      "{J}": 1839,
      "{bmatrix}1&": 1840,
      "{X}}": 1841,
      "{e}}": 1842,
      "5,": 1843,
      "_*": 1844,
      "4&": 1845,
      "\\overset": 1846,
      "{t}{": 1847,
      "98": 1848,
      "\\uparrow": 1849,
      "[t": 1850,
      "a,": 1851,
      "{co": 1852,
      "_{3}=": 1853,
      "y^{2}}": 1854,
      "_{ij}=": 1855,
      "\\Longleftrightarrow": 1856,
      "},{": 1857,
      "}})^{2}": 1858,
      "e^{x}": 1859,
      "B=": 1860,
      "}(k": 1861,
      "_{0}^{2}": 1862,
      "6}}{": 1863,
      "L=": 1864,
      "k}}": 1865,
      "(t))": 1866,
      "\\;{": 1867,
      "v_{i}": 1868,
      "^{3})": 1869,
      "4.": 1870,
      "_{R}": 1871,
      "4}}": 1872,
      "k-1}": 1873,
      "-1)}": 1874,
      "-d": 1875,
      "F)": 1876,
      "|0": 1877,
      "Z)": 1878,
      "\\oint": 1879,
      "s}{": 1880,
      "\\ll": 1881,
      "C^{": 1882,
      "},\\": 1883,
      "}(z)": 1884,
      "-1/2}": 1885,
      "-5": 1886,
      "M=": 1887,
      "_{2}^{2}": 1888,
      "].": 1889,
      "1-{": 1890,
      "cos": 1891,
      "}}x": 1892,
      "{1}{2}}{": 1893,
      "k}{": 1894,
      "ct": 1895,
      "^{-1})": 1896,
      "{f}}": 1897,
      "_{i,j}": 1898,
      "^{+}": 1899,
      "y^{": 1900,
      "{t}": 1901,
      "k=": 1902,
      "{a}}": 1903,
      "B,": 1904,
      "k^{2}": 1905,
      "_{i}+": 1906,
      "\\biggl": 1907,
      "Q=": 1908,
      "\\triangle": 1909,
      "2{": 1910,
      "_{n}+": 1911,
      ",z)": 1912,
      "ss": 1913,
      "z}}": 1914,
      "0<": 1915,
      "}(A": 1916,
      "f(z)": 1917,
      "V,": 1918,
      "_{Y": 1919,
      "}^{*": 1920,
      "0.8": 1921,
      "eph": 1922,
      "1,2,": 1923,
      "96": 1924,
      "\\aleph": 1925,
      "(1+{": 1926,
      "w)": 1927,
      "b=": 1928,
      "{(2": 1929,
      "(n,": 1930,
      "^{(": 1931,
      "(x,t)": 1932,
      "c=": 1933,
      "_{H": 1934,
      "}(X,": 1935,
      "tack": 1936,
      "L)": 1937,
      "{ra": 1938,
      "^{4}}": 1939,
      "}{dt}=": 1940,
      "3}}{": 1941,
      "P)": 1942,
      "a,b": 1943,
      "|)": 1944,
      "]^{": 1945,
      "\\,\\,\\,\\,": 1946,
      "+1}{": 1947,
      "^{2}+2": 1948,
      "{Y}": 1949,
      "(-{": 1950,
      "5}}{": 1951,
      "O(n": 1952,
      "|S": 1953,
      "(a,b": 1954,
      "_{{": 1955,
      "/n": 1956,
      "G=": 1957,
      "i=1,": 1958,
      "}^{3}": 1959,
      "-s": 1960,
      "[3": 1961,
      ",0": 1962,
      "F(x)": 1963,
      "brace": 1964,
      "_{i}{": 1965,
      "}&": 1966,
      "F_{1}": 1967,
      "\\stack": 1968,
      "\\stackrel": 1969,
      "v^{2}": 1970,
      "u=": 1971,
      "}=\\{": 1972,
      ")(": 1973,
      "{15": 1974,
      "8}{": 1975,
      "\\biggr": 1976,
      "-1}}{": 1977,
      "{3}{2}}": 1978,
      "n^{2}": 1979,
      "[-": 1980,
      "{L}}": 1981,
      "7.": 1982,
      "_{T}": 1983,
      "m_{1}": 1984,
      "_{C}": 1985,
      "_{3}(": 1986,
      "0.4": 1987,
      "m}{": 1988,
      "{R}}": 1989,
      "(n)}": 1990,
      "K=": 1991,
      "Z}": 1992,
      "_{n}]": 1993,
      "{H}}": 1994,
      "H=": 1995,
      "+j": 1996,
      "56": 1997,
      "D)": 1998,
      "x})": 1999,
      "{1}{n}": 2000,
      "(W": 2001,
      "m^{2}": 2002,
      "00}{": 2003,
      "_{j=1}^{n}": 2004,
      "t_{": 2005,
      "{1}{1-": 2006,
      "(2,": 2007,
      "_{t},": 2008,
      "_{p}}": 2009,
      "\\tanh": 2010,
      "/c": 2011,
      "w_{i}": 2012,
      "ut}": 2013,
      "^{r": 2014,
      "ing": 2015,
      "b_{2}": 2016,
      "x,y": 2017,
      "\\sec": 2018,
      "^{*}(": 2019,
      "Q}": 2020,
      "^{n}(": 2021,
      "\\deg": 2022,
      "+1)}": 2023,
      "_{3}+": 2024,
      "^{4}+": 2025,
      "2x": 2026,
      "V(": 2027,
      "9}}{": 2028,
      "sc": 2029,
      "{b}{": 2030,
      "[{t}]{2}}": 2031,
      "W}": 2032,
      "{C}}": 2033,
      "m}(": 2034,
      "\\\\&={": 2035,
      "+1)}{": 2036,
      "}(t)=": 2037,
      "{d}}": 2038,
      "{Re}": 2039,
      "C_{1}": 2040,
      "{1}{3}": 2041,
      "t^{2}}": 2042,
      "{m}{": 2043,
      "ln": 2044,
      "s=": 2045,
      "^{2n": 2046,
      "\\lceil": 2047,
      "{z}}": 2048,
      "S}{": 2049,
      "{r})": 2050,
      "{E}[": 2051,
      "2n": 2052,
      "_{K": 2053,
      "\\rceil": 2054,
      "(3)": 2055,
      "K)": 2056,
      "_+": 2057,
      "|f": 2058,
      "^{2}}{2}": 2059,
      "|1": 2060,
      "_{I": 2061,
      "L(": 2062,
      "\\bf": 2063,
      "_{t-1}": 2064,
      "(x_{1}": 2065,
      "{x}})": 2066,
      "{p}{": 2067,
      "|x|": 2068,
      "0\\": 2069,
      "c}{": 2070,
      "{v}{": 2071,
      "own": 2072,
      "t}=": 2073,
      "X_{1}": 2074,
      "v_{1}": 2075,
      "{1}{3}}": 2076,
      "[X]": 2077,
      ")}^{": 2078,
      "tt": 2079,
      "_{c}=": 2080,
      "t^{2}": 2081,
      "^{a}": 2082,
      "_{10}": 2083,
      "(10": 2084,
      "\\\\[6": 2085,
      "r_{1}": 2086,
      "\\supset": 2087,
      "A_{i}": 2088,
      "t})": 2089,
      "{\\": 2090,
      "m=": 2091,
      "{z}{": 2092,
      "-j": 2093,
      "-1)}{": 2094,
      "I=": 2095,
      "R_": 2096,
      "c}}": 2097,
      "_{V}": 2098,
      "5.": 2099,
      "^{10": 2100,
      "{S}}": 2101,
      "\\iint": 2102,
      "0}}": 2103,
      "^{2}}{2}}": 2104,
      "(A,": 2105,
      "-a)": 2106,
      "s^{2}": 2107,
      "[x]": 2108,
      "a^{2}}": 2109,
      "b}}": 2110,
      "{y}{": 2111,
      "{vmatrix}": 2112,
      "_{xx}": 2113,
      "47": 2114,
      "9.": 2115,
      "C}}": 2116,
      "4}+": 2117,
      "^{5}": 2118,
      "T=": 2119,
      "t,": 2120,
      "\\ddots": 2121,
      "(G)": 2122,
      "m_{2}": 2123,
      ")=2": 2124,
      "{in}": 2125,
      "N-1}": 2126,
      "a}}": 2127,
      "\\Le": 2128,
      "'(x)": 2129,
      "M,": 2130,
      "{1}{n}}": 2131,
      "AB": 2132,
      "y_{": 2133,
      "W_{": 2134,
      "(x_{i})": 2135,
      "{O}}_{": 2136,
      "(Q": 2137,
      ",f": 2138,
      "T})": 2139,
      "\\y": 2140,
      "_{j}}{": 2141,
      "+r": 2142,
      "-v": 2143,
      "6)": 2144,
      "h}}": 2145,
      "^{j}": 2146,
      "an": 2147,
      "{d}{dx}": 2148,
      "ax": 2149,
      "5)": 2150,
      "{re": 2151,
      "8.": 2152,
      "}(s)": 2153,
      "{12": 2154,
      "}^{i": 2155,
      "J_{": 2156,
      "^{4}}{": 2157,
      "d^{3}": 2158,
      "-q": 2159,
      "^{-1}(": 2160,
      "-u": 2161,
      "k_{1}": 2162,
      "{u}}": 2163,
      ":={": 2164,
      "1&0&": 2165,
      "cd": 2166,
      "+1,": 2167,
      ")^{1/": 2168,
      "N=": 2169,
      "_{N}": 2170,
      "}{2}})": 2171,
      "(v)": 2172,
      "{Spec": 2173,
      "-k}": 2174,
      "1{": 2175,
      "87": 2176,
      "{({": 2177,
      "}+{}": 2178,
      "{e^{-": 2179,
      "_{1}}^{": 2180,
      "{Re": 2181,
      "{1}{4}}": 2182,
      "{array": 2183,
      "\\Leftrightarrow": 2184,
      "}{2})": 2185,
      "y}{dx": 2186,
      "1/2}": 2187,
      "(Z": 2188,
      "in}": 2189,
      "_{E}": 2190,
      "\\\\[6pt]": 2191,
      "r_{2}": 2192,
      "\\bigcap": 2193,
      "(a,b)": 2194,
      "49": 2195,
      "(u,v": 2196,
      "_{q}": 2197,
      "^{b": 2198,
      "}{R": 2199,
      "n_{2}": 2200,
      "x(t)": 2201,
      "+C": 2202,
      "w}{": 2203,
      ",1}": 2204,
      "Y=": 2205,
      "x^{n}": 2206,
      "\\Bigr": 2207,
      ",N": 2208,
      "|V": 2209,
      "|}}": 2210,
      "^{n}}{": 2211,
      "\\underbrace": 2212,
      "{g}}": 2213,
      "F^{": 2214,
      "[f": 2215,
      "}(y": 2216,
      "{7}{": 2217,
      "{array}": 2218,
      "2^{2": 2219,
      "{8}{": 2220,
      "<0": 2221,
      "2^{-": 2222,
      "A_{2}": 2223,
      "{6}{": 2224,
      "d)": 2225,
      "i,j": 2226,
      "_{+": 2227,
      "L}}": 2228,
      "_{0}}^{": 2229,
      "_{i=1}^{k}": 2230,
      "S^{": 2231,
      "{y}}": 2232,
      "X,": 2233,
      "q=": 2234,
      "^{2}}})": 2235,
      "R^{2}": 2236,
      "K(": 2237,
      "n!": 2238,
      "x_{3}": 2239,
      "G,": 2240,
      "a_{1},": 2241,
      "/(": 2242,
      "E_": 2243,
      "}^{+": 2244,
      "y+": 2245,
      "{h}": 2246,
      "_{L}": 2247,
      "{11": 2248,
      "}^{2}}}": 2249,
      "{con": 2250,
      "po": 2251,
      "|E": 2252,
      ")=(": 2253,
      "2\\,": 2254,
      "_{ab}": 2255,
      "58": 2256,
      "[y": 2257,
      "N}{": 2258,
      "x^{3}+": 2259,
      "{id": 2260,
      "\\mathrel": 2261,
      "_{n}-": 2262,
      "ara": 2263,
      "\\Bigl": 2264,
      "6,": 2265,
      "X_{2}": 2266,
      "f_{2}": 2267,
      "{P}(": 2268,
      "{1}{4}": 2269,
      "^{*})": 2270,
      "_{o}": 2271,
      "{D}}": 2272,
      "^{2}+{": 2273,
      "_{i})=": 2274,
      "1+{": 2275,
      "[k": 2276,
      "}}}=": 2277,
      "\\odot": 2278,
      "}},\\": 2279,
      "+p": 2280,
      "x_{j}": 2281,
      "d_{1}": 2282,
      "p^{": 2283,
      "}^{*}": 2284,
      "{P}}": 2285,
      "{N}}": 2286,
      "_{i=1}^{m}": 2287,
      "}{4}}": 2288,
      "k}(": 2289,
      "{44": 2290,
      "0.7": 2291,
      "{F}_{": 2292,
      "T^{": 2293,
      "n,": 2294,
      "_{3}}{": 2295,
      "H(": 2296,
      "x^{n": 2297,
      "ve": 2298,
      "{1}{k": 2299,
      "f\\": 2300,
      "_{w}": 2301,
      "ack": 2302,
      "U)": 2303,
      "{1}{1+": 2304,
      "\\underset": 2305,
      "x}}{": 2306,
      "|B": 2307,
      "ight": 2308,
      "(t),": 2309,
      "+(": 2310,
      "d}}": 2311,
      "g=": 2312,
      "x}=": 2313,
      "\\!\\!\\!": 2314,
      ".{": 2315,
      "4)": 2316,
      "7}}{": 2317,
      "_{j}-": 2318,
      "S,": 2319,
      "[2": 2320,
      "_{1}},": 2321,
      "{c}}": 2322,
      "ect": 2323,
      "_{p})": 2324,
      "{e}_{": 2325,
      "_{V": 2326,
      "}}=-": 2327,
      "R_{1}": 2328,
      "}(f": 2329,
      "^{3}}}": 2330,
      "&a": 2331,
      "[}": 2332,
      "_{E": 2333,
      "_{1}{": 2334,
      "x_{i}}": 2335,
      "f(y)": 2336,
      "ise": 2337,
      "x^{2}-": 2338,
      "dr": 2339,
      "f(a": 2340,
      ")^{3}": 2341,
      "{m}}": 2342,
      "(T)": 2343,
      "{Tr}": 2344,
      "e^{-{": 2345,
      "4}}{": 2346,
      "(M)": 2347,
      "(E)": 2348,
      "\\arccos": 2349,
      "Z=": 2350,
      "u_{1}": 2351,
      "t_{1}": 2352,
      "-1})": 2353,
      "^{2}+b": 2354,
      "/p": 2355,
      "57": 2356,
      "}^{T}": 2357,
      "_{t}}": 2358,
      "_{k=0}^{n}": 2359,
      "_{c}^{": 2360,
      "\\,dy": 2361,
      "R^{": 2362,
      "D=": 2363,
      "_{n}(x": 2364,
      "e)": 2365,
      "{W}": 2366,
      "P}{": 2367,
      "u_{i}": 2368,
      "t^{": 2369,
      "(1-p": 2370,
      "&0": 2371,
      "+h": 2372,
      "c_{i}": 2373,
      ")}.": 2374,
      "(s)=": 2375,
      "{33": 2376,
      "_{n=1}^": 2377,
      "_{0}-": 2378,
      "(X,Y": 2379,
      "+1}}{": 2380,
      "l}}": 2381,
      "_{m}}": 2382,
      "_{F": 2383,
      "{k}}": 2384,
      "/2}}": 2385,
      "P_{1}": 2386,
      "_{k}}{": 2387,
      "+2)": 2388,
      ",2": 2389,
      "-8": 2390,
      "T(": 2391,
      "x_{i": 2392,
      "A_": 2393,
      "d^{2}": 2394,
      "_{i=": 2395,
      "{2}{3": 2396,
      "C_{2}": 2397,
      "P_": 2398,
      "|n": 2399,
      "al}": 2400,
      "-1\\\\": 2401,
      "e^{-2": 2402,
      "{v}}": 2403,
      "P(X": 2404,
      "ff": 2405,
      "})-": 2406,
      "u_{": 2407,
      "}(r": 2408,
      "_{n}\\}": 2409,
      "0.00": 2410,
      "/m": 2411,
      "b,": 2412,
      "(x;": 2413,
      "}(p": 2414,
      "_{p}=": 2415,
      "^{2}+y": 2416,
      "(g)": 2417,
      "ch": 2418,
      "2\\\\": 2419,
      "els": 2420,
      "{aligned}&": 2421,
      "12}": 2422,
      "a_{k}": 2423,
      "|y": 2424,
      "{1}{r": 2425,
      "}+2": 2426,
      "|\\,": 2427,
      "{q}}": 2428,
      "F}{": 2429,
      "\\N": 2430,
      "f(t": 2431,
      "{Hom}": 2432,
      "^{c": 2433,
      "(t)}": 2434,
      "\\arg": 2435,
      "(x),": 2436,
      "[(": 2437,
      "(b)": 2438,
      "})]": 2439,
      "\\ominus": 2440,
      "\\models": 2441,
      "W=": 2442,
      "u,": 2443,
      "(i)}": 2444,
      "[4": 2445,
      "k_{2}": 2446,
      "(2)}": 2447,
      "{k}{": 2448,
      "-A": 2449,
      "x_{n})": 2450,
      "_{t+1}": 2451,
      "-B": 2452,
      "m,": 2453,
      "=\\": 2454,
      "T_": 2455,
      "_{i}(x": 2456,
      "(x)}": 2457,
      "/k": 2458,
      "H_{2}": 2459,
      "e_{i}": 2460,
      "z^{2}}": 2461,
      "(x)={": 2462,
      "P}}": 2463,
      "g}}": 2464,
      "\\{\\{": 2465,
      "e^{j": 2466,
      "0.2": 2467,
      "x\\": 2468,
      "{1}{p": 2469,
      "\\back": 2470,
      "_{n}}}": 2471,
      "{2}}{": 2472,
      "slash": 2473,
      "{dy}{dx}": 2474,
      "[3]": 2475,
      "\\dim": 2476,
      "&=&": 2477,
      "{Var}": 2478,
      "e_{1}": 2479,
      "_{s}}": 2480,
      "43": 2481,
      "^{q": 2482,
      "-10": 2483,
      "_{x}=": 2484,
      "}(0)": 2485,
      "|c": 2486,
      "[A]": 2487,
      "[S": 2488,
      "0)=": 2489,
      "n_{i}": 2490,
      "u'": 2491,
      "{16": 2492,
      "+10": 2493,
      "(q)": 2494,
      ",T": 2495,
      "b_{i}": 2496,
      "w_{": 2497,
      "here": 2498,
      ",A": 2499,
      "7,": 2500,
      "+5": 2501,
      "{dx}{": 2502,
      "}(2": 2503,
      "f_{i}": 2504,
      "{le": 2505,
      "_{M}": 2506,
      "=0}": 2507,
      "slant": 2508,
      "P(A": 2509,
      "[i": 2510,
      "u,v": 2511,
      "^{-^{-": 2512,
      "{r},": 2513,
      "(m)": 2514,
      "u^{": 2515,
      "/a": 2516,
      "~,": 2517,
